<template>
    <Header/>
    <div class="mount">
    <div class="container">
      <div class="course">
        <p>
          Рад видеть тебя, друг! Меня зовут <strong>Кора</strong>, а ты находишься в начале курса <strong>ООП по Python</strong>. 
          Не многие добираются сюда, но раз ты здесь, позволь рассказать тебе о том, что будет в этом курсе. 
          Буду надеяться, что ты не уйдешь разочарованным. 
        </p>
        <br>
	    <p>
        Для начала я проведу короткий экскурс в тему курса. 
        Расскажу немного истории этого языка, зачем вообще изучать Python, 
        а также зачем вообще мне понадобилось ООП (спойлер - поверь, 
        концепции объектно-ориентированного программирования могут далеко не сразу быть понятны, 
        но когда эта тема перестанет быть предметом изучения и станет инструментом в ваших руках - Вы полюбите эту концепцию).
	      Python - это высокоуровневый язык программирования общего назначения с динамической строгой типизацией и автоматическим управлением памятью. 
        Ориентирован язык на повышение производительности разработчика, читаемость кода и его качество, 
        а также на обеспечение переносимости написанных на нём программ. 
        Другими словами, Python является далеко не самым быстрым языком по скорости выполнения кода, 
        но при этом одну и ту же задачу решить на Python получится куда быстрее, чем на большинстве других языков за счет огромного количества библиотек, 
        большого количества встроенных функций, позволяющих быстро работать с информацией и несложном синтаксисе, который быстро запоминается 
        и так же преобразуется в решение задачи.
	      Датой рождения языка принято считать 20 февраля 1991 года, а его создатель - голландский программист Гвидо ван Россум. 
        Сам язык нашел широкое применение в вебе (пусть и уступает в популярности тому же JavaScript, например, 
        который изначально создавался для web-разработки), обучении искусственного интеллекта (работа с нейросетями), 
        создании простых несложных игр, сфере data-science и во некоторых других направлениях данный язык либо является очень конкурентоспособным, 
        либо вообще не имеет конкретных конкурентов, не уступая первенство никому, и став стандартом индустрии.
        </p>
        <br>
        <p>А теперь, когда мы немного познакомились с языком, давайте начнем разбираться с ООП в этом языке.</p>
        <div class="form-btns">
          <form action="/1slide">
            <button>Далее</button>
          </form>
        </div>
        
      </div>
    </div>
  </div>
</template>

<script>
    import Header from "@/components/Header.vue";
    export default {
      name: 'CoursesView',
      components: {
          Header,
      },
    };
</script>

<style lang="scss" scoped>
@import "@/assets/css/slides.scss";
</style>