<template>
    <Header/>
    <div class="mount">
    <div class="container">
      <div class="course">
        <div class="h2-header">
          <h2>Урок 1. Вступление</h2>
        </div>
        <p>Для начала - что вообще такое ООП? Ответ “Объектно-ориентированное программирование” толком не дает ответа на этот вопрос. 
            Но давайте разбираться постепенно. 
        </p>
	    <p>
          Здесь мы встречаемся с терминами <strong>“класс”, “объект”, “экземпляр”, “поле”, “методы”</strong>. Давайте разберемся на примере. 
          Допустим, создается программа по учету котов и кошек. 
          Соответственно, мы имеем дело с объектами “коты”, и было бы хорошо все данные, связанные с котами, объединить в единое целое. 
          Это можно сделать с помощью класса. Класс можно воспринимать как некий шаблон, по которому будут формироваться экземпляры - конкретные коты и кошки. 
          Так, например, у всех кошек есть порода, пол, имя и возраст. Программист сам решает, какие свойства будет иметь тот или иной класс.
        </p>
        <br>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/test.jpg" alt="">
        </div>
        <p>Возьмем две кошки. Первая кошка имеет породу “Бурма”, зовут её “Васька”, и ей 3 года. 
            Вторая кошка имеет породу “Саванна”, зовут её Прелесть и ей 5 лет. 
            Говоря по-программистски, у нас 2 <strong>экземпляра</strong> класса - Васька и Прелесть, 
            у которых есть порода, имя и возраст, и они являются экземплярами класса Cats.
            И очень удобно, что мы можем работать с данными об этих кошках как с единым целым.
            Класс может описывать некий алгоритм, присущий именно этому объекту. 
            Например, можно определить метод (функцию), который бы рисовал этого кота где-либо. 
            И переиспользовать его на любом другом экземпляре (на любом другом коте или кошке).
        </p>
        <p>
            А теперь давайте перейдем к практике. 
            Начнем с того, что научимся создавать классы, объекты, а также добавлять и удалять их атрибуты - данные.
        </p>
        <p>
            Создадим класс <strong>Point</strong>, в котором будет определено расположение точек на плоскости. 
            Пишем ключевое слово класса - <strong>class</strong>, и давайте назовем его Point. Ставим двоеточие. 
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/1.png" alt="">
        </div>
        <p>
            Согласно стандарту <strong>PEP8</strong>, название класса должно начинаться с большой буквы. 
            Если Вы не знаете, что это за стандарт, то очень советую его поизучать, потому что если будете его соблюдать, 
            ваш код будет куда читабельнее как для вас, так и для других программистов, а это очень важно. Ну и конечно же, 
            очень рекомендую называть классы так, чтобы название отражало суть этого класса.
        </p>
        <p>
            У нас уже есть класс, но пока что в данной реализации он, по сути, бесполезен. 
            Давайте добавим в него две переменные - цвет и размер. 
            Переменные внутри класса принято называть <strong>“атрибуты”</strong>, и впоследствии давайте будем использовать именно такую терминологию.
        </p>
        <p>
            Давайте зададим цвет “красный”, а размер - 2. 
            Для того, чтобы получить доступ к этим переменным, нам нужно прописать Point.color или Point.size. 
            Наш класс Point - это, по сути, <strong>пространство имен</strong>, через которое мы можем обращаться к атрибутам и методам 
            (функциям) нашего класса.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/2.png" alt="">
        </div>
        <p>
            Например, для того, чтобы изменить размер, указанный в нашем классе, мы можем написать <strong>Point.size = 3</strong>, 
            и теперь по умолчанию атрибут size будет равен 3. 
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/3.png" alt="">
        </div>
        <p>
            Для того, что увидеть все переменные класса, нам нужно прописать <strong>Point.__dict__</strong>.
            Прописав её, мы видим много всяких атрибутов, и среди них мы можем увидеть color и size.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/4.png" alt="">
        </div>
        <p>
            Давайте теперь создадим экземпляр нашего класса.
            Для этого нам нужно указать название нашего экземпляра и “вызвать” класс.
            <strong>Пример - “a = Point()”</strong>.
        </p>
        <p>
            Для того, чтобы узнать к какому классу принадлежит какая-либо переменная или же экземпляр класса, мы можем написать <strong>“type(a)”</strong>, 
            и в нашем случае получим <strong>class ‘__main__.Point’</strong>. 
            Таким образом мы наглядно видим, что переменная “а” является экземпляром класса Point.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/5.png" alt="">
        </div>
        <p>
            Также мы можем проверить, является ли переменная экземпляром какого-то конкретного класса при помощи <strong>“type(a) == Point”</strong>. 
            На выходе мы получаем <strong>true</strong>, так что да, <strong>“а” является экземпляром класса Point</strong>.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/6.png" alt="">
        </div>
        <p>
            Ну и для полноты картины, чтобы проверить является ли “а” экземпляром класса Point, мы можем написать <strong>“isinstance(a, Point)”</strong>, 
            и также на выходе получаем true.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/7.png" alt="">
        </div>
        <p>
	        То есть имя класса выступает в качестве типа данных, как, например, int, float, boolean и др.
        </p>
        <p>
            По сути, при создании экземпляров, они образуют свое пространство имен, и если мы поменяем, например, 
            у экземпляра a значение атрибута color - то цвет изменится только у а, 
            и никак не затронет b или значение по умолчанию, указанное в классе Point.
        </p>
        <p>
            Мы можем прямо в коде добавлять новые атрибуты при помощи <strong>setattr</strong>. 
            Пишем setattr, открываем круглые скобки, пишем название класса, затем название нового атрибута, и затем значение. 
            Так, мы можем прописать <strong>setattr(Point, “type”, “vector”)</strong>, и теперь у всех экземпляров класса появится новый атрибут type, 
            и значением по умолчанию будет “vector”. 
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/8.png" alt="">
        </div>
        <p>
            Помимо этого, через setattr мы можем поменять значение уже существующего атрибута. 
            И если мы напишем <strong>setattr(Point, ‘size’, 14)</strong>, мы в классе Point поставим значение по умолчанию 14. 
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/9.png" alt="">
        </div>
        <p>
            Ещё мы можем получить данные из класса при помощи Point.size, но что будет, если мы укажем <strong>несуществующий</strong> атрибут? 
            Например, Point.date?
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/10.png" alt="">
        </div>
        <p>
             Мы получим <strong>исключение</strong>, но этого можно избежать при помощи <strong>getattr</strong>. 
            И если мы пропишем getattr(Point, date), то мы все равно получим ошибку. Но если мы добавим третий аргумент, 
            и у нас получится <strong>getattr(Point, ‘date’, False)</strong>, то третий аргумент будет возвращаться, 
            если указанный аргумент (на второй позиции) не существует.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/11.png" alt="">
        </div>
        <p>
            Ну а если мы укажем <strong>существующий</strong> аргумент через
            <strong> (getattr(Point, ‘size’, False))</strong>, то нам вернется значение size.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/12.png" alt="">
        </div>
        <p>
            А ещё мы можем <strong>удалять</strong> атрибуты из класса. Допустим, мы хотим удалить атрибут color.
            Пишем <strong>del Point.size</strong>, и у нас удаляется этот атрибут. 
            С этим стоит быть аккуратнее, поскольку если мы удалим несуществующий атрибут, то получим необрабатываемое исключение, 
            и с этим стоит быть аккуратнее.
        </p>
        <p>
            Для того, чтобы проверить, существует ли какой-либо атрибут, мы можем использовать <strong>hasattr</strong>. 
            Например, <strong>hasattr(Point, ‘color’)</strong> вернет нам True, потому что color существует в нашем классе Point.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/firstSlide/13.png" alt="">
        </div>
        <p>
            Если мы попытаемся удалить у “a” атрибут “color”, то он поменяется на тот, что по умолчанию прописан в классе Point. 
            То бишь “color” у “a” станет “black”. 
            А при попытке удалить size из экземпляра a, мы получим исключение, поскольку “size” в “a” <strong>НЕ</strong> переопределен, 
            и его как бы не существует в самом “a”.
        </p>
        <p>
            Поиск того или иного атрибута выполняется следующим образом - сначала ведется поиск в текущем пространстве имен 
            (например, в экземпляре “a”), а если не находит, то ведется поиск во внешнем пространстве имен.
        </p>
        <div class="form-btns">
          <form action="/courses">
          <button>Назад</button>
          </form>
          <form action="/2slide">
            <button>Далее</button>
          </form>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
    import Header from "@/components/Header.vue";
    export default {
      name: 'CoursesView',
      components: {
          Header,
      },
    };
</script>

<style lang="scss" scoped>
@import "@/assets/css/slides.scss";
</style>