<template>
    <Header/>
    <div class="mount">
    <div class="container">
      <div class="course">
        <div class="h2-header">
          <h2>Урок 3. Инициализатор __init__ и финализатор __del__</h2>
        </div>
        <p>
            Начнем с того, что в каждом классе есть так называемые <strong>магические методы</strong>. 
            Их можно узнать по характерным <strong>двойным подчеркиваниям</strong> в начале и конце слова. 
            Сейчас поговорим про <strong>инициализатор</strong> и <strong>финализатор</strong>.
            Для начала - зачем нам вообще они нужны?
            Вроде и без них все работает.
        </p>
        <p>
            Когда мы создавали экземпляр класса и вызывали функцию set_coords(), мы как бы инициализировали значения в нашем экземпляре. 
            Но было бы неплохо, чтобы переменные x и y создавались <strong>сразу</strong>, а наш класс оставался неизменным по размеру
        </p>
        <p>
            Давайте в начале реализации нашего класса пропишем простенький <strong>def __init__</strong>, и напишем в нём print о том, 
            что __init__ был вызван, а также объявим атрибуты <strong>x</strong> и <strong>y</strong> и проинициализируем их нулями.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/thirdSlide/1.png" alt="">
        </div>
        <p>
            Теперь при создании экземпляра класса мы сможем заметить, 
            что у нас вызвался наш магический метод-инициализатор и в <strong>x</strong> и <strong>y</strong> присвоились нули.
        </p>
        <p>
            Детально это происходит следующим образом. 
            Сначала происходит <strong>создание объекта в памяти устройства</strong> и, 
            непосредственно перед созданием, <strong>вызов метода __new__</strong>, 
            о котором мы поговорим позже. А следом за этим, вызывается метод <strong>__init__</strong>, где происходит инициализация объекта.
        </p>
        <p>
            Но что если мы хотим указать значения x и y <strong>сразу</strong> при создании экземпляра класса? 
            Для этого нам в __init__ нужно добавить в сигнатуре функции две переменные - x и y, 
            и в локальные атрибуты класса записать то, что мы получили “сверху”.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/thirdSlide/2.png" alt="">
        </div>
        <p>
            Теперь при создании экземпляра, мы должны в круглые скобки передать два значения, 
            которыми мы хотим инициализировать наши x и y внутри класса, а если мы этого не сделаем, 
            то выкинется <strong>исключение</strong>.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/thirdSlide/3.png" alt="">
        </div>
        <p>
            Чтобы этого избежать, мы можем в сигнатуре магического метода сразу присвоить нули x и y. 
            Так мы сможем создавать как просто объект класса Point, инициализированный нулями, 
            так и сразу указать, чем именно мы хотим проиницилизировать наши переменные.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/thirdSlide/4.png" alt="">
        </div>
        <p>
            Теперь поговорим о финализаторе <strong>__del__</strong>.
            Он вызывается перед уничтожением экземпляра класса.
            Давайте создадим наш финализатор и в нем пропишем print о том, что был вызван финализатор.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/thirdSlide/5.png" alt="">
        </div>
        <p>
            Может возникнуть вполне закономерный вопрос - <strong>когда вообще вызывается этот финализатор</strong>? 
            Мы ведь нигде не говорим о том, что хотим удалить наш экземпляр.
            Все работает довольно просто. В языке Python есть так называемый <strong>“сборщик мусора”</strong> - 
            специальный <strong>алгоритм</strong>, который если видит, что какой-либо экземпляр больше не используется, удаляет его, 
            чтобы освободить память компьютера.
        </p>
        <div class="form-btns">
          <form action="/2slide">
            <button>Назад</button>
          </form>
          <form action="/4slide">
            <button>Далее</button>
          </form>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
    import Header from "@/components/Header.vue";
    export default {
      name: 'CoursesView',
      components: {
          Header,
      },
    };
</script>

<style lang="scss" scoped>
@import "@/assets/css/slides.scss";
</style>