<template>
    <Header/>
    <div class="mount">
    <div class="container">
      <div class="course">
        <div class="h2-header">
          <h2>Урок 3. Инициализатор __init__ и финализатор __del__</h2>
        </div>
        <p>
            Начнем с того, что в каждом классе есть так называемые магические методы. 
            Их можно узнать по характерным двойным подчеркиваниям в начале и конце слова. 
            Сейчас поговорим про инициализатор и финализатор.
            Для начала - зачем нам вообще они нужны?
            Вроде и без них все работает.
        </p>
        <p>
            Когда мы создавали экземпляр класса и вызывали функцию set_coords(), мы как бы инициализировали значения в нашем экземпляре. 
            Но было бы неплохо, чтобы переменные x и y создавались сразу, а наш класс оставался неизменным по размеру
        </p>
        <p>
            Давайте в начале реализации нашего класса пропишем простенький def __init__, и напишем в нём print о том, что __init__ был вызван, 
            а также объявим атрибуты x и y и проинициализируем их нулями.
            Теперь при создании экземпляра класса мы сможем заметить, что у нас вызвался наш магический метод-инициализатор и в x и y присвоились нули.
        </p>
        <p>
            Детально это происходит следующим образом. 
            Сначала происходит создание объекта в памяти устройства и непосредственно перед созданием, вызов метода __new__, 
            о котором мы поговорим позже. А следом за этим, вызывается метод __init__, где происходит инициализация объекта.
        </p>
        <p>
            Но что если мы хотим указать значения x и y сразу при создании экземпляра класса? 
            Для этого нам в __init__ нужно добавить в сигнатуре функции две переменные - x и y, 
            и в локальные атрибуты класса записать то, что мы получили “сверху”.
            Теперь при создании экземпляра, мы должны в круглые скобки передать два значения, 
            которыми мы хотим инициализировать наши x и y внутри класса, а если мы этого не сделаем, 
            то выкинется исключение. Чтобы этого избежать, мы можем в сигнатуре магического метода сразу присвоить нули x и y. 
            Так мы сможем создавать как просто объект класса Point, инициализированный нулями, 
            так и сразу указать, чем именно мы хотим проиницилизировать наши переменные.
        </p>
        <p>
            Теперь поговорим о финализаторе __del__.
            Он вызывается перед уничтожением экземпляра класса.
            Давайте создадим наш финализатор и в нем пропишем print о том, что был вызван финализатор.
            Может возникнуть вполне закономерный вопрос - а когда вообще вызывается этот финализатор? 
            Мы ведь нигде не говорим о том, что хотим удалить наш экземпляр.
            Все работает довольно просто. В языке Python есть так называемый “сборщик мусора” - 
            специальный алгоритм, который если видит, что какой-либо экземпляр больше не используется, удаляет его, 
            чтобы освободить память компьютера.
        </p>
        <div class="form-btns">
          <form action="/2slide">
            <button>Назад</button>
          </form>
          <form action="/4slide">
            <button>Далее</button>
          </form>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
    import Header from "@/components/Header.vue";
    export default {
      name: 'CoursesView',
      components: {
          Header,
      },
    };
</script>

<style lang="scss" scoped>
@import "@/assets/css/slides.scss";
</style>