<template>
    <Header/>
    <div class="mount">
    <div class="container">
      <div class="course">
        <div class="h2-header">
          <h2>Урок 6. Инкапсуляция. Public, protected, private</h2>
        </div>
        <p>
          Давайте так же создадим простенький класс Point.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/sixthSlide/1.png" alt="">
        </div>
        <p>
          Когда создается экземпляр этого класса, то локальные свойства x и y доступны извне. 
          Кроме того, мы <strong>можем менять</strong> эти значения извне.
          Если мы <strong>НЕ</strong> хотим, чтобы пользователь программист мог менять эти значения, нам нужно сделать их закрытыми.
        </p>
        <p>
          <ul>
            <li><strong>attribute</strong> - public свойство(без одного или двух подчеркиваний вначале) .</li>
            <li><strong>_attribute</strong> - protected (для обращения внутри класса и во всех его дочерних классах)</li>
            <li><strong>__attribute</strong> - private (для обращения только внутри класса).</li>
          </ul>
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/sixthSlide/2.png" alt="">
        </div>
        <p>
          Но если мы обновим названия этих переменных, сделав их protected и попытаемся их поменять извне - у нас все равно все получится. 
          Дело в том, что эти подчеркивания лишь <strong>СИГНАЛИЗИРУЮТ</strong> о том, что эти данные менять не следует.
          Однако же, если мы захотим сделать их private и поставим два подчеркивания, то извне мы к ним обратиться не сможем.
        </p>
        <p>
          Для чего вообще это нужно? Как я уже говорил, <strong>классы стоит воспринимать целиком</strong>. 
          И чтобы не нарушить корректную работу внутри класса, мы и разделяем переменные на те, 
          изменение которых извне не приведет к проблемам, и те переменные, которые опасно давать другому 
          пользователю-программисту, потому что он сможет непреднамеренно или же наоборот, 
          намеренно, что-то сломать в работе нашего класса. 
        </p>
        <p>
          Чтобы можно было задавать значения переменным, есть так называемые <strong>“сеттеры”</strong> и <strong>“геттеры”</strong>.
        </p>
        <div class="div__img__center">
            <img class="img__center" src="@/assets/img/sixthSlide/3.png" alt="">
        </div>
        <p>
          Они нужны для того, чтобы можно было удобно давать и забирать данные из класса. 
          <strong>Правильно написанный сеттер не позволит другому программисту криво передать данные для обработки в класс</strong>, 
          если предусмотреть в сеттере определенные проверки (например, чтобы нельзя было передавать переменные типа float), 
          а геттеры позволят получать данные из класса.
        </p>
        <p>
          Но то, что мы успели обсудить с подчеркиваниями, работает только для переменных. 
          Для функций предусмотрен другой функционал. 
          Мы можем из библиотеки <strong>accessify</strong> импортировать private и protected декораторы, и использовать их там, 
          где нам необходимо, прописав над нужной функцией тот декоратор, который нам понадобился.
        </p>
        <div class="form-btns">
          <form action="/5slide">
            <button>Назад</button>
          </form>
          <form action="/7slide">
            <button>Далее</button>
          </form>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
    import Header from "@/components/Header.vue";
    export default {
      name: 'CoursesView',
      components: {
          Header,
      },
    };
</script>

<style lang="scss" scoped>
@import "@/assets/css/slides.scss";
</style>